#include <iostream>

using namespace std;

int main(){
    double a=0, b=0;
    cout<<"Задание 1.4, введите 2 числа для которых нужно посчитать суму, разность, произведение, частное их квадратов\n";
    cin>> a>> b;
    cout<<"сумма квадратов чисел "<< a<<" и "<< b<<"= "<<a*a+b*b<<"\n"
    <<"разность квадратов чисел "<< a<<" и "<< b<<"= "<<a*a - b*b<<"\n"
    <<"произведение квадратов чисел "<< a<<" и "<< b<<"= "<<a*a*b*b<<"\n"
    <<"частное квадратов чисел "<< a<<" и "<< b<<"= "<<a*a/b*b<<"\n";
    return 0;
}




