#include <iostream>
#include<cmath>
using namespace std;

int main(){
    double a=0, b=0;
    cout<<"Задание 1.5, введите 2 числа для которых нужно посчитать суму, разность, произведение, частное их модулей\n";
    cin>> a>> b;
    cout<<"сумма модулей чисел "<< a<<" и "<< b<<"= "<<abs(a)+abs(b)<<"\n"
    <<"разность модулей чисел "<< a<<" и "<< b<<"= "<<abs(a) - abs(b)<<"\n"
    <<"произведение модулей чисел "<< a<<" и "<< b<<"= "<<abs(a)*abs(b)<<"\n";
      if(b!=0){
    cout<<"частное модулей чисел "<< a<<" и "<< b<<"= "<<abs(a)/abs(b)<<"\n";
    }
    return 0;
}
