#include <iostream>
#include <math.h>
using namespace std;
int main()
{
	int x;
	cout<<"Введите значение x:\n";
	cin>>x;
	
	if (x== 0) {
		cout<<"Значение числа нулевое";
	}
	else if ((x > 0) && (x%2==0)){
		cout<<"Значение числа положительное и четное ";
	}
	else if ((x > 0) && (x % 2 != 0)) {
		cout<<"Значение числа положительное и нечетное";
	}
	else if ((x < 0) && (x % 2 != 0)) {
		cout<<"Значение числа отрицательное и нечетное";
	}
	else if ((x < 0) && (x % 2 == 0)) {
		cout<<"Значение числа отрицательное и четное";
	}
		
	return 0;
}