#include <iostream>
#include <math.h>

using namespace std;

int main(){
    int x1=0,y1=0,x2=0,y2=0,l=0,h=0;
    bool run=1;
    cout <<"5.4 Даны координаты двух противоположных вершин прямоугольника:(x1, y1), (x2, y2). Стороны прямоугольника параллельны осям координат."
<<"\nНайти периметр и площадь данного прямоугольника.\n";
    while (run>0){
            cout<<" Введите координаты точки A(x1,y1) ";
            cin >> x1>> y1;
            cout <<"\nВведите координаты точки B(x2,y2) ";
            cin >> x2>> y2;
            h=abs(x1-x2);
            l=abs(y1-y2);
            cout<<"Периметр прямоугольника ="<<l*2+h*2<<"\nПлощадь прямоугольника = "<<l*h;
            cout<<"\n введите 1 чтобы начать программу заново, 0 чтобы закрыть";
        cin>>run;
    }
    return 0;
}