#include <iostream>
using namespace std;
double v1,v2,s,t,answ;
int main()
{
    cout<<"ЛР7п4 Скорость первого автомобиля v1, второго v2, расстояние между ними S км, на каком расстоянии они будут через t часов, если они едут в противоположные стороны?\nВведите v1\n";
    cin>>v1;
    cout<<"\nВведите v2\n";
    cin>>v2;
    cout<<"\nВведите s\n";
    cin>>s;
    cout<<"\nВведите t\n";
    cin>>t;
    answ=(v1+v2)*t+s;
    cout<<"\nЧерез "<<t<<" часов, эти автомобили будут на расстоянии "<<answ<<" км";
    return 0;
}